{
    "title" : "Basics Of Programming",
    "content" : "<p><span style=\"font-size:22px\">Basics Of Programming &gt;<\/span><\/p>\r\n\r\n<p><span style=\"font-size:22px\">Ok, i won&#39;t be just copy pasting this article from the internet, i&#39;ll try to write it on my own.<\/span><\/p>\r\n\r\n<p><u><span style=\"font-size:22px\">So what is programming ?<\/span><\/u><\/p>\r\n\r\n<p><span style=\"font-size:22px\">ans : It is the process of creating a set of instructions for the computer so that it knows how to perform a task. Its a basic answer but it&#39;s true in whole aspects. Let&#39;s take a scenerio, where we tell the computer that &quot;bro,&nbsp;you have to do this task for me&quot; and it&#39;ll reply &quot;100010100010111110&quot; and surely we&#39;ll not understand what it is saying. Actually computer has its own language ie, binary. We can communicate with it using binary digits, but since we don&#39;t know how to communicate in binary, here comes our savior, Programming languages.&nbsp;<\/span><\/p>\r\n\r\n<p><u><span style=\"font-size:22px\">So what does programming language do ?<\/span><\/u><\/p>\r\n\r\n<p><span style=\"font-size:22px\">ans : When we are unable to communicate to the computer in binary digits, programming language come to save us. We can tell the computer through different programming languages, what we want to say and the computer will then understand it and we can then see the output.&nbsp;<\/span><\/p>\r\n\r\n<p><u><span style=\"font-size:22px\">Different types of programming languages :<\/span><\/u><\/p>\r\n\r\n<p><span style=\"font-size:22px\">&gt; There are over 300 types of programming languages that exist as of 2022. Main languages include : C, C++, HTML, Css, Javascript, Python, Ruby, Flutter etc.<\/span><\/p>\r\n\r\n<p><span style=\"font-size:22px\">Most of them are easy to understand and learn, but some can be really tricky when it comes to learning! If you ever think that &quot;xyz&quot; language is not understandable, just refer to Google. I know it&#39;s cheating, but no one is perfect in this world, So don&#39;t worry about refering to google, even the best of developers also use google to refer to something. So why can&#39;t you ?😉.<\/span><\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p><span style=\"font-size:22px\">That&#39;s it guys, for this post. Thank you so much for sparing&nbsp; your time to read this post. Have a nice day!<\/span><\/p>",
    "author" : "Ansh Bhai",
    "metadesc" : "Learn the basics of programming in few minutes, i'll teach you how.",
    "slug" : "basics-of-programming"
}