{
    "title" : "Why Every Developer Should Start Blogging",
    "content" : "<p><span style=\"font-size:22px\"><u>Why every developer should blog like me &gt;<\/u><\/span><\/p>\r\n\r\n<p><span style=\"font-size:22px\">You guys must have listened -&gt; Sharing is caring. That&#39;s what our motto, right ? Well yes. So here i am gonna tell you why you should blog if you are a developer and what benefits you&#39;ll get from it.<\/span><\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p><span style=\"font-size:22px\">There&#39;s a long list of reasons why you should have your own blog:<\/span><\/p>\r\n\r\n<p><span style=\"font-size:22px\">1) By teaching others, you&#39;ll become a better programmer. Teaching or explaining concepts to other people will force you to learn more about the topic and organize your thoughts in a more precise way.<\/span><\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p><span style=\"font-size:22px\">2) Possibility for making side income through advertising or selling products and services to your readers.<\/span><\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p><span style=\"font-size:22px\">3) Your blog has the potential to open the door for networking and business opportunities that you may not have found otherwise.<\/span><\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p><span style=\"font-size:22px\">4) Your software career can be greatly enhanced if you can effectively communicate and present your ideas to other people. A coding blog will certainly help you hone those types of skills.<\/span><\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p><span style=\"font-size:22px\">5) A coding blog will help you become an authority in your field. Being an authority helps you stand out among other developers and opens the door for leadership roles.<\/span><\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p><span style=\"font-size:22px\">Every software developer or coder should have a blog where they share new ideas they have or write guides that help other developers solve the problems they face.<\/span><\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p><span style=\"font-size:22px\">That&#39;s it guys, for this post. Thank you so much for sparing your time to read this post. Have a nice day!<\/span><\/p>\r\n",
    "author" : "Ansh Bhai",
    "metadesc" : "Why every web developer should start blogging right now!",
    "slug" : "why-every-developer-should-blog"
}